labs/debugging/ollydbg.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Lab 1: Ollydbg</title>
<!-- 2017-01-17 Tue 13:08 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />



</head>
<body>
<div id="content">
<h1 class="title">Lab 1: Ollydbg</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Key Finding</a>
<ul>
<li><a href="#sec-1-1">1.1. Getting started</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1. Start the program in ollydbg</a></li>
</ul>
</li>
<li><a href="#sec-1-2">1.2. Finding the important parts</a></li>
<li><a href="#sec-1-3">1.3. Reversing the password</a>
<ul>
<li><a href="#sec-1-3-1">1.3.1. Reading assembly</a></li>
<li><a href="#sec-1-3-2">1.3.2. Pulling out the password</a></li>
</ul>
</li>
<li><a href="#sec-1-4">1.4. The lazy way: patching</a></li>
<li><a href="#sec-1-5">1.5. Recap</a>
<ul>
<li><a href="#sec-1-5-1">1.5.1. Finding something</a></li>
<li><a href="#sec-1-5-2">1.5.2. Patching</a></li>
<li><a href="#sec-1-5-3">1.5.3. Tracing</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-2">2. References</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Key Finding</h2>
<div class="outline-text-2" id="text-1">
<p>
In this lab, we'll use OllyDbg to figure out a password that will
let us access protected functionality in a very simple
program. Double click the Lab1.exe file on the desktop to run the
program. You will see that it gives you three attempts to type a
working password, then exits. We're going to use OllyDbg to observe
the operation of this program in order to discover what password(s)
will work to get us past the check.
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Getting started</h3>
<div class="outline-text-3" id="text-1-1">
<p>
First, launch ollydbg from your desktop icon. You'll see a
collection of several viewports and a large number of buttons. The
interface has a fairly steep learning curve for more advanced uses,
but for the basic operations we'll use today it should be easy to
operate. For a more in-depth exploration of ollydbg's features and
UI, take a look at this chapter in <a href="https://books.google.com/books?id=DhuTduZ-pc4C&lpg=PA181&ots=3dkPSpSagz&dq=ollydbg%20interface&pg=PA182#v=onepage&q=ollydbg%20interface&f=false">Practical Malware Analysis</a>.
</p>
</div>

<div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> Start the program in ollydbg</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
To start the program, you can either just run it as before and
    attach, or you can launch it from ollydbg. In this case, use the
    File-&gt;Open menu item to launch the program. Ollydbg will stop at
    the program's entry point and wait for instructions from you. If
    you press the play button ollydbg will run the program without
    stopping it until either a breakpoint or an exception occurs.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Finding the important parts</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Almost all of the art of reverse engineering boils down to finding
clever ways to avoid the painful work of reading reams of assembly
code. Even a tiny program like this would take hours or days to
fully comprehend if you had to figure out all of the details about
what it does. Fortunately, we don't really care about that. What
we want is much simpler - to locate the password check and figure
out how to get past it and see what happens on the other side.
</p>

<p>
To do that, we'll use the program's behavior to shortcut the
analysis problem and land right where we need to be. The program
seems to behave in this way:
</p>
<ol class="org-ol">
<li>Ask user for a password
</li>
<li>Verify correctness of the password
<ol class="org-ol">
<li>If it is correct, do something we haven't seen yet
</li>
<li>If not, give the user two more attempts and then exit.
</li>
</ol>
</li>
</ol>

<p>
There are several points during this process that could be very
helpful to us. We'll use two methods to locate the relevant
code. The first and most obvious clue is probably the message
that's displayed when the password doesn't match. We can use
ollydbg to tell the program to stop when a piece of memory is
accessed, so we will find that message in the program's memory and
put a breakpoint on it. The second method is to take advantage of
the fact that the program stops when it's waiting for our
input. We'll run it until it's waiting for input, then break into
it with ollydbg and trace the stack up to see what function is
called to get input. From there we will find the password check
function by tracing.
</p>
</div>

<ol class="org-ol"><li><a id="sec-1-2-0-1" name="sec-1-2-0-1"></a>Use ollydbg's analysis features<br  /><div class="outline-text-5" id="text-1-2-0-1">
<p>
Right-click in the memory window (bottom left part of the screen)
and pick "Search for &gt; All referenced strings". This will open a
window with an entry for each string reference ollydbg could find
in the program. Scan through the list to find the "Access Denied"
string, then press Enter to go to that instruction in the
disassembler view. At this point, it is probably pretty obvious
that we're close to the main part of the program that does the
password check. Hold that thought, we're going to go through a
couple of other ways to find this point before we continue.
</p>
</div>
</li>
