labs/debugging/ollydbg.org
**** Using program's built-in wait points
     Another way to find the piece of code we want is to recognize
     that the program is going to get a piece of string data from the
     system, and then use it later to check the password. Since it has
     to stop while we type our password, we can simply let it get to
     that point, then see where it is in the debugger and set a
     breakpoint.
     
     Go ahead and push the restart button (looks like two triangles
     pointing left) to reload the program. Press play again and wait
     for it to ask for the password, then go to ollydbg and press the
     pause button.

     In order to find the part of the code we want, we now need to
     figure out what function originally called the input
     function. First, open the threads window in ollydbg by pressing
     the "T" button. Find the main thread (look in the leftmost column
     for "Main"). Click that thread, then press Enter to follow the
     address in the disassembler.

     You will now be looking at the main thread with all views. Go
     over to the stack view (bottom right corner). This displays all
     data on the program's stack, which includes the return addresses
     for each currently active function call (exactly what we
     want!). There are a large number of functions currently
     active. Here's where it's important to get the big picture in
     mind, which is that we're looking for application code specific
     to the program we're working on. For that reason, we will just
     scroll through the stack until we find the first instance of a
     return to code that's in lab1.exe. Scroll down and look at each
     line that starts with "RETURN from" to find the first one that
     has lab1 in the name (e.g. "RETURN from msvcrt.7573987B to
     lab1.00401a5e").
     
     Looking at this function, you should see the same interesting
     code we saw before.

**** Memory breakpoint
     Sometimes the memory we're searching for doesn't come up
     automatically in ollydbg's analysis. In that case, we'll have to
     search for it directly. 
     
     Ollydbg allows you to search for data in segments of memory
     allocated to the process. If you have a segment open in the dump,
     disassembler, or stack, you can just right click or press Ctrl+B
     in that section to search the currently visible memory
     segment. However, most of the time you probably won't know which
     part of the process's memory has the data you want. In order to
     search the entire process, you need to open the memory map
     window. To do this, press the blue "M" button (or press
     Alt-M). You are now looking at the memory map, which lists all of
     the memory in use by the process along with various bits of data
     for each mapped region.

     To search for a string, press Ctrl+B in the memory map window,
     then type the string you're looking for in the appropriate
     box. In this case, we're looking for an "Access denied" which is
     probably plain ASCII, so enter that into the top box.

     Ollydbg will search through the mapped memory in order and list
     all matches. When you get a match, it will open it in the dump
     window. You should see your string there. Right click the first
     byte and select "Breakpoint > Memory". You can just click OK on
     the dialog that opens up to enter breakpoint details. Now click
     play on the debugger and type an incorrect password.

     Ollydbg stops when the string is accessed, which is deep in a
     call stack to write text to the console. Make sure you're in the
     main thread and use the stack walking technique again from before
     to find where in lab1.exe this call was made. You're now in the
     same place you found with the other methods.

** Reversing the password
    Now we're ready to start digging into the actual password recovery
    portion of the lab. We've found the point in the code where the
    password result is checked. What we need to do now is use that
    entry point to find the actual code that does the password check
    and analyze it to see what we need to use for a password in order
    to gain access.

    You should have your debugger paused in the function we found
    earlier (if not, repeat one of the above methods to find it
    again). Ollydbg will have already analyzed the code to find
    function boundaries for you. If you look to the left of the
    disassembly listing, you'll see a vertical line that ends on the
    ~RETN~ instruction and goes upward in the listing. Scroll up until
    you find the end of that line, which will be at a ~PUSH EBP~
    instruction. This is the entry point of the function. Set a
    breakpoint here and restart the program.

    After you press play, the program will stop at your
    breakpoint. You can now step through the code and watch what the
    program does at various points. We want to see which function
    calls are I/O related and which are password validation related,
    so we don't want to descend into them yet. We'll use the ~Step
    over~ button (also ~F8~) to do this. Press ~F8~ a few times until
    the program seems to stop responding. It is now waiting for your
    input. Type a password and press ~Enter~.

*** Reading assembly
    Because you used the step over function, ollydbg will run the
    entire input call before pausing the program again. We're now at
    the next step after the ~fgets~ call. This is where we really want
    to start paying attention to what happens. Press ~F8~ again until
    you reach a ~CALL~ instruction.

    If you look at this ~CALL~, you'll see that it takes the string as
    an argument (it is at the top of the stack in the stack window),
    and its return value is used to decide how to branch right
    afterward. Use the arrow keys to navigate down a few instructions
    to find the ~JZ~ instruction. This instruction is a jump that will
    happen only if the zero condition flag is set by the previous
    ~TEST~ instruction. When this instruction is highlighted, you'll
    see an arrow that appears to the left showing where the jump will
    land if it happens. In this case, it stops at a ~PUSH~ instruction
    which loads the address of our "Access denied" string. From this,
    we can deduce that a return of zero from the function we're
    stopped at means the password check failed, so our password check
    probably happens in or below this function.

