labs/debugging/ollydbg.org
*** Pulling out the password
     In order to retrieve the password, we need to watch how it is
     checked. Press ~F7~ to enter the function we're stopped on.

     Now that we've found a point very close to the target, we should
     set a breakpoint on it and note the address. Press ~F2~ to set a
     breakpoint, then press ~:~ and type a name you'll remember for
     the function (something like 'check-password' works). You can use
     this later to find this location again.

     Press ~F7~ until you get to the first ~CMP~ (for CoMPare)
     instruction. If you look in the little space between the
     disassembly view and the memory dump view, you'll see that
     ollydbg is helpfully decoding that 0x67 into the ASCII letter
     'g'. This ~CMP~ instruction is taking the first byte of the
     argument (which is the password you typed) and comparing it to
     the letter 'g'.

     Press ~F7~ again to get to the ~JE~ instruction. ~JE~ means Jump
     if Equal, so this jump will happen only if the previous
     comparison came out equal. If you look at the target of the jump,
     it's just a couple of instructions further down and looks very
     much like the little block of code we just executed. If the jump
     is not taken, you can see that the ~EAX~ register will be set to
     zero and the code will jump to a different location. Arrow down
     to that ~JMP~ instruction to see what happens. Based on this
     analysis, we can conclude that the first character of our
     password probably needs to be 'g'.

     Continue in this way until you have recovered the entire
     password, then run the program outside of the debugger to verify
     that you have it right.

** The lazy way: patching
    Sometimes we don't really have to figure out what the password
    is. If the program is not designed well, it's easier to just patch
    over the password check and skip it entirely. That's what we're
    going to do now.

    Restart the program in ollydbg and navigate to the password
    checking function. If you made a label, you can right click in the
    disassembly window and select "Search for > Names", then scan down
    the list until you find your label. Click it and press ~Enter~ to
    go there. If not, you can go there using the breakpoints window
    (opened with the blue 'B' button) by selecting the breakpoint and
    pressing ~Enter~.

    We know from before that our password check fails if this function
    returns zero. Knowing that, we can just change this function so
    that it always returns 1, and we should be able to access the
    hidden features without ever figuring out a valid password. To do
    this, go down to the end of the function where the ~RETN~
    instruction is. In the standarc C calling convention, the return
    value of a function is put into the ~EAX~ register before the
    function returns. Remember from earlier that an incorrect letter
    in the password made the function place zero in ~EAX~ just before
    jumping to the end and returning. If we change the instruction
    that writes to ~EAX~ so that it puts a 1 there instead, we can
    cause the call to succeed as long as our first letter is /not/
    part of the password! 

    Navigate to the fist ~CMP~ instruction, then down to the ~MOV~
    instruction below it that zeros ~EAX~. Double click that
    instruction and change the zero to a 1, then click
    "Assemble". Ollydbg will automatically generate the appropriate
    machine code for you and patch the memory accordingly. Now press
    play and enter a password that starts with the wrong letter. You
    have patched the binary to bypass the password check.

** Recap
    The main objective of most reverse engineering work is to find
    what you want without getting bogged down hand tracing heaps of
    assembly code and data structures. We used several techniques in
    ollydbg in this lab to find and bypass a password check, with very
    little actual code tracing.

*** Finding something
     Use clues from the program you're debugging to get close to the
     piece of code you want to find. In our case, we used strings that
     we knew were accessed nearby, and we used the fact that the
     program had to block while waiting for input to get the password.

     1. Use ollydbg's analysis features to look for references to
        interesting data (~Search for~ > ~All referenced strings~)
     2. Use the program's blocking behavior to land us near the
        function, then follow the call stack back to code we care
        about.
     3. Search the program's memory for data we know is used near our
        point of interest, then set memory breakpoints on it.

*** Patching
     Sometimes you can get a program to do what you want with a very
     simple patch. Ollydbg makes on-the-fly patching very easy with
     its built-in assembler. The main issue with patching is to ensure
     that your patch fits in the space you have available - you can't
     move things in a binary without a /lot/ of work, so you have to
     work within the constraints of what's already there.

*** Tracing
     If you need to understand an algorithm, there is really no
     alternative other than to trace it. We traced the password
     checking algorithm in this lab to determine what password would
     unlock the program. Real-life tracing is typically much harder
     than this, but works on basically the same principles: Single
     step through the code and keep track of what it's doing.
* References
  1. Instruction set reference: [[http://ref.x86asm.net][X86Asm.net]]
  2. [[http://www.ollydbg.de/quickst.htm][Ollydbg Quickstart]]
