labs/debugging/ollydbg.html

<div id="outline-container-sec-1-3-2" class="outline-4">
<h4 id="sec-1-3-2"><span class="section-number-4">1.3.2</span> Pulling out the password</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
In order to retrieve the password, we need to watch how it is
checked. Press <code>F7</code> to enter the function we're stopped on.
</p>

<p>
Now that we've found a point very close to the target, we should
set a breakpoint on it and note the address. Press <code>F2</code> to set a
breakpoint, then press <code>:</code> and type a name you'll remember for
the function (something like 'check-password' works). You can use
this later to find this location again.
</p>

<p>
Press <code>F7</code> until you get to the first <code>CMP</code> (for CoMPare)
instruction. If you look in the little space between the
disassembly view and the memory dump view, you'll see that
ollydbg is helpfully decoding that 0x67 into the ASCII letter
'g'. This <code>CMP</code> instruction is taking the first byte of the
argument (which is the password you typed) and comparing it to
the letter 'g'.
</p>

<p>
Press <code>F7</code> again to get to the <code>JE</code> instruction. <code>JE</code> means Jump
if Equal, so this jump will happen only if the previous
comparison came out equal. If you look at the target of the jump,
it's just a couple of instructions further down and looks very
much like the little block of code we just executed. If the jump
is not taken, you can see that the <code>EAX</code> register will be set to
zero and the code will jump to a different location. Arrow down
to that <code>JMP</code> instruction to see what happens. Based on this
analysis, we can conclude that the first character of our
password probably needs to be 'g'.
</p>

<p>
Continue in this way until you have recovered the entire
password, then run the program outside of the debugger to verify
that you have it right.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> The lazy way: patching</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Sometimes we don't really have to figure out what the password
is. If the program is not designed well, it's easier to just patch
over the password check and skip it entirely. That's what we're
going to do now.
</p>

<p>
Restart the program in ollydbg and navigate to the password
checking function. If you made a label, you can right click in the
disassembly window and select "Search for &gt; Names", then scan down
the list until you find your label. Click it and press <code>Enter</code> to
go there. If not, you can go there using the breakpoints window
(opened with the blue 'B' button) by selecting the breakpoint and
pressing <code>Enter</code>.
</p>

<p>
We know from before that our password check fails if this function
returns zero. Knowing that, we can just change this function so
that it always returns 1, and we should be able to access the
hidden features without ever figuring out a valid password. To do
this, go down to the end of the function where the <code>RETN</code>
instruction is. In the standarc C calling convention, the return
value of a function is put into the <code>EAX</code> register before the
function returns. Remember from earlier that an incorrect letter
in the password made the function place zero in <code>EAX</code> just before
jumping to the end and returning. If we change the instruction
that writes to <code>EAX</code> so that it puts a 1 there instead, we can
cause the call to succeed as long as our first letter is <i>not</i>
part of the password! 
</p>

<p>
Navigate to the fist <code>CMP</code> instruction, then down to the <code>MOV</code>
instruction below it that zeros <code>EAX</code>. Double click that
instruction and change the zero to a 1, then click
"Assemble". Ollydbg will automatically generate the appropriate
machine code for you and patch the memory accordingly. Now press
play and enter a password that starts with the wrong letter. You
have patched the binary to bypass the password check.
</p>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> Recap</h3>
<div class="outline-text-3" id="text-1-5">
<p>
The main objective of most reverse engineering work is to find
what you want without getting bogged down hand tracing heaps of
assembly code and data structures. We used several techniques in
ollydbg in this lab to find and bypass a password check, with very
little actual code tracing.
</p>
</div>

<div id="outline-container-sec-1-5-1" class="outline-4">
<h4 id="sec-1-5-1"><span class="section-number-4">1.5.1</span> Finding something</h4>
<div class="outline-text-4" id="text-1-5-1">
<p>
Use clues from the program you're debugging to get close to the
piece of code you want to find. In our case, we used strings that
we knew were accessed nearby, and we used the fact that the
program had to block while waiting for input to get the password.
</p>

<ol class="org-ol">
<li>Use ollydbg's analysis features to look for references to
interesting data (<code>Search for</code> &gt; <code>All referenced strings</code>)
</li>
<li>Use the program's blocking behavior to land us near the
function, then follow the call stack back to code we care
about.
</li>
<li>Search the program's memory for data we know is used near our
point of interest, then set memory breakpoints on it.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-5-2" class="outline-4">
<h4 id="sec-1-5-2"><span class="section-number-4">1.5.2</span> Patching</h4>
<div class="outline-text-4" id="text-1-5-2">
<p>
Sometimes you can get a program to do what you want with a very
simple patch. Ollydbg makes on-the-fly patching very easy with
its built-in assembler. The main issue with patching is to ensure
that your patch fits in the space you have available - you can't
move things in a binary without a <i>lot</i> of work, so you have to
work within the constraints of what's already there.
</p>
</div>
</div>

<div id="outline-container-sec-1-5-3" class="outline-4">
<h4 id="sec-1-5-3"><span class="section-number-4">1.5.3</span> Tracing</h4>
<div class="outline-text-4" id="text-1-5-3">
<p>
If you need to understand an algorithm, there is really no
alternative other than to trace it. We traced the password
checking algorithm in this lab to determine what password would
unlock the program. Real-life tracing is typically much harder
than this, but works on basically the same principles: Single
step through the code and keep track of what it's doing.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> References</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>Instruction set reference: <a href="http://ref.x86asm.net">X86Asm.net</a>
</li>
<li><a href="http://www.ollydbg.de/quickst.htm">Ollydbg Quickstart</a>
</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2017-01-17 Tue 13:08</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
